{"data":{"allMarkdownRemark":{"edges":[{"node":{"excerpt":"Context Bicicultura is the biggest event about cycling culture in Brazil, and is hold every year in a different city. The event aims to…","fields":{"slug":"/bicicultura-pwa/"},"frontmatter":{"date":"2018-05","date2":"2018-06","title":"Bicicultura PWA","description":"A simple web app for improving attendees' experience in the biggest brazilian conference on bike culture.","tags":["activism","development","volunteer","UI/UX"],"cover":{"publicURL":"/static/cover-b0a0487ce5ad311b08fa5d3a49842969.png"}}}},{"node":{"excerpt":"Context VTEX is a global SaaS technology company focused on ecommerce solutions that have a daily impact on the work of thousands of people…","fields":{"slug":"/vtex-home/"},"frontmatter":{"date":"2018-03","date2":"2018-10","title":"VTEX Admin Home","description":"A new home for the an e-commerce platform admin, setting the ground for a new generation of Admin UIs.","tags":["UI/UX","work"],"cover":{"publicURL":"/static/photo_cropped-567d6ed72ad0f68131cd64bc5aad34ad.jpg"}}}},{"node":{"excerpt":"Overview Our challenge was to develop a VR experience with the theme “Learn by Doing”. We focused in taking advantage of the platform’s…","fields":{"slug":"/game-of-lives/"},"frontmatter":{"date":"2017-06","date2":null,"title":"Game of Lives","description":"A story-telling VR game inspired by the best “walking simulators” that will challenge you to see the world from other people’s eyes. Winner of the first Isobar International Hackathon.","tags":["hackathon","game","social"],"cover":{"publicURL":"/static/cover-147fcc7de3e79100b798c06582a475fd.png"}}}},{"node":{"excerpt":"Overview We believe that the bicycle is the future of urban mobility, and that having better bike parkings is a great way of promoting the…","fields":{"slug":"/bike-de-boa/"},"frontmatter":{"date":"2016-10","date2":"Now","title":"bike de boa","description":"A collaborative map of places to park your bike safely, encouraging you to bike more. With the web app you can search for bike parkings nearby and map new ones while learning about urban mobility and what makes good bike parking and safe streets.","tags":["progressive web app","UI/UX","platform","activism"],"cover":{"publicURL":"/static/cover-7c24c58378f3e78a797a9d33e0a8d40c.png"}}}},{"node":{"excerpt":"Problem How many awesome people there are in our University that we never get to know their work, just because we didn’t take the same…","fields":{"slug":"/infhub/"},"frontmatter":{"date":"2012-09-07","date2":"2013-07-25","title":"infHUB","description":"A platform for university students share their projects.","tags":["social network","platform","academic","UI/UX"],"cover":{"publicURL":"/static/cover-ae7b6920df6702f9ba28ec1608700291.png"}}}},{"node":{"excerpt":"Since 2007 I’ve been managing a digital portfolio of digital and analogic photography that has been viewed more than 250,000 times on Flickr…","fields":{"slug":"/photography/"},"frontmatter":{"date":"2007","date2":"Now","title":"Photography","description":"Photography has been for many years the main way in which I try to express my views. I try to see the world from different perspectives, looking for beauty in the most ordinary places. ","tags":["art","hobby"],"cover":{"publicURL":"/static/cover-93f96bf9373358e741fe025e628ef20e.png"}}}},{"node":{"excerpt":"I was an active member of DeviantArt, one of the biggest online communities for digital artists. There I learned and taught from digital art…","fields":{"slug":"/space-art/"},"frontmatter":{"date":"2004","date2":"2007","title":"Space Art","description":"My first incursion with digital art, and probably the birth of my aesthetic self. Making space wallpapers got me started with digital design tools like Photoshop and 3D modeling software and also with a vibrant community of online artists and designers.","tags":["art","illustration","old"],"cover":{"publicURL":"/static/space1-31f82f5c3ab7c531248db874dc72b34a.jpg"}}}}]}},"pageContext":{}}