{"data":{"goodreadsShelf":{"id":"reviewList-14179336","shelfName":"currently-reading","reviews":[{"reviewID":"2571209207","rating":"0","votes":"0","spoilerFlag":"false","dateAdded":"Tue Oct 23 10:58:53 -0700 2018","dateUpdated":"none","book":{"bookID":"4865","isbn":null,"isbn13":"9780671723651","textReviewsCount":"8110","uri":"kca://book/amzn1.gr.book.v1.rKo_rjo_Jxag7Cf2yDnvzg","link":"https://www.goodreads.com/book/show/4865.How_to_Win_Friends_and_Influence_People","title":"How to Win Friends and Influence People","titleWithoutSeries":"How to Win Friends and Influence People","imageUrl":"https://images.gr-assets.com/books/1442726934m/4865.jpg","smallImageUrl":"https://images.gr-assets.com/books/1442726934s/4865.jpg","largeImageUrl":"","description":"You can go after the job you want...and get it! You can take the job you have...and improve it! You can take any situation you're in...and make it work for you!<br /><br />Since its release in 1936, <i>How to Win Friends and Influence People</i> has sold more than 15 million copies. Dale Carnegie's first book is a timeless bestseller, packed with rock-solid advice that has carried thousands of now famous people up the ladder of success in their business and personal lives.<br /><br />As relevant as ever before, Dale Carnegie's principles endure, and will help you achieve your maximum potential in the complex and competitive modern age.<br /><br />Learn the six ways to make people like you, the twelve ways to win people to your way of thinking, and the nine ways to change people without arousing resentment."}},{"reviewID":"2505267833","rating":"0","votes":"0","spoilerFlag":"false","dateAdded":"Thu Aug 23 21:09:25 -0700 2018","dateUpdated":"none","book":{"bookID":"29939161","isbn":"1250103509","isbn13":"9781250103505","textReviewsCount":"585","uri":"kca://book/amzn1.gr.book.v1.NJeHuQ2ZP-1Q84jxFkU48w","link":"https://www.goodreads.com/book/show/29939161-radical-candor","title":"Radical Candor: Be a Kickass Boss Without Losing Your Humanity","titleWithoutSeries":"Radical Candor: Be a Kickass Boss Without Losing Your Humanity","imageUrl":"https://images.gr-assets.com/books/1482838407m/29939161.jpg","smallImageUrl":"https://images.gr-assets.com/books/1482838407s/29939161.jpg","largeImageUrl":"","description":"From the time we learn to speak, we’re told that if you don’t have anything nice to say, don’t say anything at all. While this advice may work for everyday life, it is, as Kim Scott has seen, a disaster when adopted by managers.<br /><br />Scott earned her stripes as a highly successful manager at Google and then decamped to Apple, where she developed a class on optimal management. She has earned growing fame in recent years with her vital new approach to effective management, the “radical candor” method.<br /><br />Radical candor is the sweet spot between managers who are obnoxiously aggressive on one side and ruinously empathetic on the other. It’s about providing guidance, which involves a mix of praise as well as criticism—delivered to produce better results and help employees achieve.<br /><br />Great bosses have strong relationships with their employees, and Scott has identified three simple principles for building better relationships with your employees: make it personal, get (sh)it done, and understand why it matters.<br /><br /><i>Radical Candor </i>offers a guide to those bewildered or exhausted by management, written for bosses and those who manage bosses. Taken from years of the author’s experience, and distilled clearly giving actionable lessons to the reader; it shows managers how to be successful while retaining their humanity, finding meaning in their job, and creating an environment where people both love their work and their colleagues."}},{"reviewID":"2390983404","rating":"0","votes":"0","spoilerFlag":"false","dateAdded":"Sun May 13 21:55:28 -0700 2018","dateUpdated":"none","book":{"bookID":"35857337","isbn":null,"isbn13":null,"textReviewsCount":"10","uri":"kca://book/amzn1.gr.book.v1.END_5VqVRp1telYs6DbIcg","link":"https://www.goodreads.com/book/show/35857337-better-web-typography-for-a-better-web","title":"Better Web Typography for a Better Web","titleWithoutSeries":"Better Web Typography for a Better Web","imageUrl":"https://images.gr-assets.com/books/1501505439m/35857337.jpg","smallImageUrl":"https://images.gr-assets.com/books/1501505439s/35857337.jpg","largeImageUrl":"","description":"Better Web Typography for a Better Web is a book is based on a top-rated online course explaining typography to people who build web sites—web designers and web developers. The author, Matej Latin, takes complex concepts such as vertical rhythm, modular scale and page composition, and explains them in a simple way. The content of the book is accompanied by live code examples and the readers design and build an example website as they go through it. This is a new typography book for a new medium, the rules haven't changed much, everything else has."}},{"reviewID":"2227509688","rating":"0","votes":"0","spoilerFlag":"false","dateAdded":"Tue Dec 26 19:25:01 -0800 2017","dateUpdated":"none","book":{"bookID":"25810399","isbn":"0525429840","isbn13":"9780525429845","textReviewsCount":"90","uri":"kca://book/amzn1.gr.book.v1.fBK9l_nZexe8w50-nIFxrA","link":"https://www.goodreads.com/book/show/25810399-streetfight","title":"Streetfight: Handbook for an Urban Revolution","titleWithoutSeries":"Streetfight: Handbook for an Urban Revolution","imageUrl":"https://images.gr-assets.com/books/1453057457m/25810399.jpg","smallImageUrl":"https://images.gr-assets.com/books/1453057457s/25810399.jpg","largeImageUrl":"","description":"<b>\n  <b>An empowering road map for rethinking, reinvigorating, and redesigning our cities, from a pioneer in the movement for safer, more livable streets</b>\n</b><br /><br />As New York City’s transportation commissioner, Janette Sadik-Khan managed the seemingly impossible and transformed the streets of one of the world’s greatest, toughest cities into dynamic spaces safe for pedestrians and bikers. Her approach was dramatic and effective: Simply painting a part of the street to make it into a plaza or bus lane not only made the street safer, but it also lessened congestion and increased foot traffic, which improved the bottom line of businesses. Real-life experience confirmed that if you know how to read the street, you can make it function better by not totally reconstructing it but by reallocating the space that’s already there. <br />      Breaking the street into its component parts, <i>Streetfight</i> demonstrates, with step-by-step visuals, how to rewrite the underlying “source code” of a street, with pointers on how to add protected bike paths, improve crosswalk space, and provide visual cues to reduce speeding. Achieving such a radical overhaul wasn’t easy, and <i>Streetfight</i> pulls back the curtain on the battles Sadik-Khan won to make her approach work. She includes examples of how this new way to read the streets has already made its way around the world, from pocket parks in Mexico City and Los Angeles to more pedestrian-friendly streets in Auckland and Buenos Aires, and innovative bike-lane designs and plazas in Austin, Indianapolis, and San Francisco. Many are inspired by the changes taking place in New York City and are based on the same techniques. <i>Streetfight</i> deconstructs, reassembles, and reinvents the street, inviting readers to see it in ways they never imagined."}},{"reviewID":"1929092995","rating":"0","votes":"0","spoilerFlag":"false","dateAdded":"Wed Mar 01 19:42:36 -0800 2017","dateUpdated":"none","book":{"bookID":"23692271","isbn":null,"isbn13":null,"textReviewsCount":"12180","uri":"kca://book/amzn1.gr.book.v1.4aaEOknMj7166lgef5EmXw","link":"https://www.goodreads.com/book/show/23692271-sapiens","title":"Sapiens: A Brief History of Humankind","titleWithoutSeries":"Sapiens: A Brief History of Humankind","imageUrl":"https://images.gr-assets.com/books/1420585954m/23692271.jpg","smallImageUrl":"https://images.gr-assets.com/books/1420585954s/23692271.jpg","largeImageUrl":"","description":"100,000 years ago, at least six human species inhabited the earth. Today there is just one. Us. Homo sapiens. <br /><br />How did our species succeed in the battle for dominance? Why did our foraging ancestors come together to create cities and kingdoms? How did we come to believe in gods, nations and human rights; to trust money, books and laws; and to be enslaved by bureaucracy, timetables and consumerism? And what will our world be like in the millennia to come? <br /><br />In <i>Sapiens</i>, Dr Yuval Noah Harari spans the whole of human history, from the very first humans to walk the earth to the radical – and sometimes devastating – breakthroughs of the Cognitive, Agricultural and Scientific Revolutions. Drawing on insights from biology, anthropology, paleontology and economics, he explores how the currents of history have shaped our human societies, the animals and plants around us, and even our personalities. Have we become happier as history has unfolded? Can we ever free our behaviour from the heritage of our ancestors? And what, if anything, can we do to influence the course of the centuries to come? <br /><br />Bold, wide-ranging and provocative, Sapiens challenges everything we thought we knew about being human: our thoughts, our actions, our power ... and our future."}}]},"allMarkdownRemark":{"edges":[{"node":{"excerpt":"Context Bicicultura is the biggest event about cycling culture in Brazil, and is hold every year in a different city. The event aims to…","fields":{"slug":"/bicicultura-pwa/"},"frontmatter":{"date":"2018-05","date2":"2018-06","title":"Bicicultura PWA","description":"A simple web app for improving attendees' experience in the biggest brazilian conference on bike culture.","tags":["activism","development","volunteer","UI/UX"],"cover":{"publicURL":"/static/cover-b0a0487ce5ad311b08fa5d3a49842969.png"},"forceOrder":null}}},{"node":{"excerpt":"Context VTEX is a global SaaS technology company focused on ecommerce solutions that have a daily impact on the work of thousands of people…","fields":{"slug":"/vtex-home/"},"frontmatter":{"date":"2018-03","date2":"2018-10","title":"VTEX Admin Home","description":"A new home for the an e-commerce platform admin, setting the ground for a new generation of Admin UIs.","tags":["UI/UX","work"],"cover":{"publicURL":"/static/photo_cropped-567d6ed72ad0f68131cd64bc5aad34ad.jpg"},"forceOrder":2}}},{"node":{"excerpt":"Overview Our challenge was to develop a VR experience with the theme “Learn by Doing”. We focused in taking advantage of the platform’s…","fields":{"slug":"/game-of-lives/"},"frontmatter":{"date":"2017-06","date2":null,"title":"Game of Lives","description":"A story-telling VR game inspired by the best “walking simulators” that will challenge you to see the world from other people’s eyes. Winner of the first Isobar International Hackathon.","tags":["hackathon","game","social"],"cover":{"publicURL":"/static/cover-3a17864e63fcfc17e26695fa9b09af50.png"},"forceOrder":null}}},{"node":{"excerpt":"Overview We believe that the bicycle is the future of urban mobility, and that having better bike parkings is a great way of promoting the…","fields":{"slug":"/bike-de-boa/"},"frontmatter":{"date":"2016-10","date2":"Now","title":"bike de boa","description":"A collaborative map of places to park your bike safely, encouraging you to bike more. With the web app you can search for bike parkings nearby and map new ones while learning about urban mobility and what makes good bike parking and safe streets.","tags":["progressive web app","UI/UX","platform","activism"],"cover":{"publicURL":"/static/cover-7c24c58378f3e78a797a9d33e0a8d40c.png"},"forceOrder":1}}},{"node":{"excerpt":"Problem How many awesome people there are in our University that we never get to know their work, just because we didn’t take the same…","fields":{"slug":"/infhub/"},"frontmatter":{"date":"2012-09-07","date2":"2013-07-25","title":"infHUB","description":"A platform for university students share their projects.","tags":["social network","platform","academic","UI/UX"],"cover":{"publicURL":"/static/cover-ae7b6920df6702f9ba28ec1608700291.png"},"forceOrder":null}}},{"node":{"excerpt":"Since 2007 I’ve been managing a digital portfolio of digital and analogic photography that has been viewed more than 250,000 times on Flickr…","fields":{"slug":"/photography/"},"frontmatter":{"date":"2007","date2":"Now","title":"Photography","description":"Photography has been for many years the main way in which I try to express my views. I try to see the world from different perspectives, looking for beauty in the most ordinary places.","tags":["art","hobby"],"cover":{"publicURL":"/static/cover-93f96bf9373358e741fe025e628ef20e.png"},"forceOrder":null}}},{"node":{"excerpt":"I was an active member of DeviantArt, one of the biggest online communities for digital artists. There I learned and taught from digital art…","fields":{"slug":"/space-art/"},"frontmatter":{"date":"2004","date2":"2007","title":"Space Art","description":"My first incursion with digital art, and probably the birth of my aesthetic self. Making space wallpapers got me started with digital design tools and with a vibrant online community of online artists and designers.","tags":["art","illustration","old"],"cover":{"publicURL":"/static/space1-31f82f5c3ab7c531248db874dc72b34a.jpg"},"forceOrder":null}}}]}},"pageContext":{}}