{"data":{"markdownRemark":{"id":"e15a203c-3bc0-5c02-b3a7-afef45b5b0d2","excerpt":"Context Bicicultura is the biggest event about cycling culture in Brazil, and is hold every year in a different city. The event aims to…","htmlAst":{"type":"root","children":[{"type":"element","tagName":"h2","properties":{},"children":[{"type":"text","value":"Context"}]},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"Bicicultura is the biggest event about cycling culture in Brazil, and is hold every year in a different city. The event aims to bring together discussions and workshops on the diverse theme of urban mobility, touching the cultural, social, political, artistic, economic and environmental. It’s organized by UCB, the biggest organization on ciclism in the country, and is helped by local groups. "}]},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"In the past year the event was held in Recife, which I had the pleasure to visit per invitation to present my project Bike de Boa. In 2018 the event would be held in Rio de Janeiro, the city where I just moved to, and I had a personal will to contribute not only with another presentation but also with the organization. The group Transporte Ativo and its leader Zé Lobo are highly influential in the cicloativism scene and I was fortunate to know them already from a past partnership."}]},{"type":"text","value":"\n"},{"type":"element","tagName":"h2","properties":{},"children":[{"type":"text","value":"Problem"}]},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"The idea of developing an app for the event appeared chatting with the organization and seemed like a great opportunity for using my skills to help them. The official website was a simple Wordpress page, and I thought the user experience of checking the event schedule was far from great."}]},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"There were budget limitations for improving the website, but the most critical part is that they wouldn’t be able to afford even printing the schedule to offer the participants. Their solution was to provide a link to download a PDF of that same website version, which didn’t help a lot."}]},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"element","tagName":"img","properties":{"src":"./website_schedule_desktop.gif"},"children":[]}]},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"We devised then that the main objective of an even app would be to improve the experience for the event participants on checking the schedule. This task would need to be supported either for users in their desktops, when they are at home planning the visit, but mainly the mobile case, for checking the schedule during the event. An offline experience would be critical as well, since the Museum didn’t have wi-fi and many brazilians can’t afford decent 3G plans."}]},{"type":"text","value":"\n"},{"type":"element","tagName":"h2","properties":{},"children":[{"type":"text","value":"Development"}]},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"Since I didn’t have much time available for the project and I was the only developer and designer I needed to be very mindful of the technologic solutions, priorizing powerful frameworks and tools and reusing pre-made solutions."}]},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"The natural technology choice for me was to build PWA (Progressive Web App). Not only I’m very used to web technologies, but being a PWA I could offer everything a native app but without the need to develop the same solution multiple times. The main advantages I would be leveraging would be then:"}]},{"type":"text","value":"\n"},{"type":"element","tagName":"ul","properties":{},"children":[{"type":"text","value":"\n"},{"type":"element","tagName":"li","properties":{},"children":[{"type":"text","value":"Offline support"}]},{"type":"text","value":"\n"},{"type":"element","tagName":"li","properties":{},"children":[{"type":"text","value":"Ability to add the app to the home screen"}]},{"type":"text","value":"\n"},{"type":"element","tagName":"li","properties":{},"children":[{"type":"text","value":"Full screen experience (no address bar)"}]},{"type":"text","value":"\n"},{"type":"element","tagName":"li","properties":{},"children":[{"type":"text","value":"Cross-platform and cross-device with a single source code."}]},{"type":"text","value":"\n"}]},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"Today the easiest way to develop a simple PWA is using React, which also has a vibrant community that develops open-source tools that I could reuse. I used the create-react-act boilerplate for automating everything about the project build phase."}]},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"For the UI I chose to use a React UI lib that implemented the Material Design System. This choice was also natural since an unique visual identity was not much of a priority. Moreover users would be using this app for the first time and only for a few days, so it was interesting to employ the Material well-known patterns and visual style to reduce cognitive work of understanding the app. Still, some very basic customization was done mainly with the Typography and Color Pallete to mirror the event visual identity.  "}]},{"type":"text","value":"\n"},{"type":"element","tagName":"h2","properties":{},"children":[{"type":"text","value":"Solution"}]},{"type":"text","value":"\n"},{"type":"element","tagName":"h2","properties":{},"children":[{"type":"text","value":"Results"}]},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"The app was highlighted in all the major event communications, both digital and physical, which was super important for reaching the target audience. I was delighted to see people using the app on their phones all the time during the event, and even caught one or two suggesting it to others that were checking that old PDF solutions in their small phone screens. "}]},{"type":"text","value":"\n"},{"type":"element","tagName":"div","properties":{},"children":[{"type":"element","tagName":"results-banner","properties":{"data":"{\n        \"event total visitors\": \"427\",\n        \"app total users\": \"500\",\n        \"sessions\": \"1,166\",\n        \"PWA installs\": \"32\"\n    }"},"children":[{"type":"text","value":"\n"}]}]},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"element","tagName":"img","properties":{"src":"./infhub1.png"},"children":[]}]}],"data":{"quirksMode":false}},"frontmatter":{"title":"Bicicultura PWA","description":"A simple web app for checking the schedule for the biggest brazilian conference on bike culture.","date":"January, 2018","date2":null,"tags":["side-project","activism","pwa","volunteer"],"cover":null},"fields":{"readingTime":{"text":"4 min read"}}}},"pageContext":{"slug":"/bicicultura-pwa/","previous":{"excerpt":"Overview Our challenge was to develop a VR experience with the theme “Learn by Doing”. We focused in taking advantage of the platform’s…","fields":{"slug":"/game-of-lives/"},"frontmatter":{"date":"2017","date2":null,"title":"Game of Lives","description":"A story-telling VR game inspired by the best “walking simulators” that will challenge you to see the world from other people’s eyes.","tags":["hackathon","game","social"],"cover":{"publicURL":"/static/cover-147fcc7de3e79100b798c06582a475fd.png"}}},"next":{"excerpt":"Problem Research Development","fields":{"slug":"/vtex-home/"},"frontmatter":{"date":"2018","date2":null,"title":"VTEX Home","description":"A new home for the VTEX Admin.","tags":["ux"],"cover":null}}}}